backend/app/controllers/api/v1/actors_controller.rb

SELECT "actors".* FROM "actors"
---
  def index
    @actors = Actor.all

INSERT INTO "actors" ("name", "pic_url", "nationality", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @actor = Actor.new(actors_params)
    if @actor.save